app/controllers/songs_controller.rb

  def new
    if !!params[:artist_id] && !Artist.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    if !!params[:artist_id]
      if !Artist.find_by(id: params[:artist_id])
        redirect_to artists_path, alert: "Could not find Artist"
      else
        @nested = true
        @song = Song.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 20]]